// Задача 25: Напишите метод, который принимает на вход два числа (A и B) и 
// возводит число A в натуральную степень B.
//  использовать Math.Pow
// 3, 5 -> 243 
// 2, 4 -> 16



int x = 3;
int degree = 5;
int c = x^degree;
{
   Console.WriteLine(c);
}



